Updated architecture diagram in readme
